const cardsArray = [
    [
        ["ПЕШКА", "ЛАДЬЯ", "СЛОН", "ФЕРЗЬ", "КОНЬ", "КОРОЛЬ", "КОРОЛЕВА"],
        ["МЕТР", "СЕКУНДА", "РАММ", "КИЛОГРАММ", "МИЛЛИМЕТР", "КИЛОМЕТР", "ЛИТР"],
        ["УХО", "ГУБЫ", "ЗУБЫ", "БРОВЬ", "BEKO", "ГЛАЗ", "НОС"],
        ["ТРУБА", "РАКОВИНА", "ВАННА", "УНИТАЗ", "КРАН", "ДУШ", "МОЙКА"],
        ["РУКАВ", "ПЕТЛЯ ДЛЯ ПУГОВИЦЫ", "ВОРОТНИК", "МАНЖЕТА", "ЗАСТЕЖКА-МОЛНИЯ", "ПУГОВИЦА", "КАРМАН"],
        ["ЛЕЖАТЬ", "СИДЕТЬ", "СТОЯТЬ", "СТОЯТЬ НА КОЛЕНЯХ", "СТОЯТЬ НАГНУВШИСЬ", "СТОЯТЬ НА ПРАВОЙ НОГЕ", "СТОЯТЬ НА ЛЕВОЙ НОГЕ"],
        ["ВНУТРИ", "СНАРУЖИ", "СЛЕВА", "СПРАВА", "СВЕРХУ", "СНИЗУ", "ВОКРУГ"],
        ["МАНЕКЕН", "ФАРФОРОВАЯ СТАТУЭТКА", "РОБОТ", "ТОТЕМ", "МАРИОНЕТКА", "ПУГАЛО", "СТАТУЯ"],
        ["ГРАБЛИ", "СОВОК", "МОТЫГА", "ТОПОР", "ЛОПАТА", "КИРКА", "ВИЛЫ"],
        ["ФИШКА", "ПЕСОЧНЫЕ ЧАСЫ", "КОЛОДА КАРТ", "КУБИКИ", "ИГРОВОЕ ПОЛЕ", "КОРОБКА ИЗ-ПОД ИГРЫ", "КАРТЫ В РУКЕ"],
        ["БАСКЕТБОЛЬНОЕ КОЛЬЦО", "ФУТБОЛЬНЫЕ ВОРОТА", "ТЕННИСНАЯ СЕТКА", "ХОККЕЙНЫЕ ВОРОТА", "ВОЛЕЙБОЛЬНАЯ СЕТКА", "СЕТКА ДЛЯ ПИНГ-ПОНГА", "ЛУНКА В ИГРЕ ГОЛЬФ"],
        ["ЛАДОНЬ", "СУСТАВ ПАЛЬЦА", "БОЛЬШОЙ ПАЛЕЦ", "УКАЗАТЕЛЬНЫЙ ПАЛЕЦ", "СРЕДНИЙ ПАЛЕЦ", "БЕЗЫМЯННЫЙ ПАЛЕЦ", "МИЗИНЕЦ"],
        ["НАДУВНОЙ ПЛОТ", "ЛОДКА", "ПИРОГА", "КАТАМАРАН", "БУКСИРНЫЙ КАТЕР", "КРЕЙСЕР", "ПАРОХОД"],
        ["РЯСА", "ВЕЧЕРНЕЕ ПЛАТЬЕ", "ШАЛЬ", "ПЛАТЬЕ", "КОСЫНКА", "ЮБКА", "ВУАЛЬ"],
        ["СТОЯТЬ НА ГОЛОВЕ", "СТОЯТЬ НА РУКАХ", "ПОДТЯГИВАТЬСЯ", "ДЕЛАТЬ КОЛЕСО", "ДЕЛАТЬ КУВЫРОК В ПРЫЖКЕ", "ПРИСЕДАТЬ", "ОТЖИМАТЬСЯ"],
        ["ОДНОСТОРОННЕЕ ДВИЖЕНИЕ", "СТОЯНКА ЗАПРЕЩЕНА", "ДЕТИ", "ЖЕЛЕЗНОДОРОЖНЫЙ ПЕРЕЕЗД", "ПОВОРОТ НАЛЕВО", "ПЕШЕХОДНЫЙ ПЕРЕХОД", "СТОП"],
        ["НОСКИ", "БОТИНКИ", "РУБАШКА", "ТРУСЫ", "БРЮКИ", "САНДАЛИИ", "ФУТБОЛКА"],
        ["ЛУК", "БУЛАВА", "МЕЧ", "КОПЬЁ", "АЛЕБАРДА", "ЩИТ", "АРБАЛЕТ"],
        ["ПЛЯЖНЫЙ МЯЧ", "ВОЗДУШНЫЙ ШАРИК", "АЭРОСТАТ", "ТЕННИСНЫЙ МЯЧИК", "ЙО-ЙО", "ФУТБОЛЬНЫЙ МЯЧ", "ПУШЕЧНОЕ ЯДРО"],
        ["РАКЕТА", "ПОЕЗД", "АВТОБУС", "САМОЛЕТ", "ВЕРТОЛЕТ", "ГРУЗОВИК", "АВТОМОБИЛЬ"],
        ["ТЕННИСНАЯ РАКЕТКА", "БЕЙСБОЛЬНАЯ БИТА", "КЛЮШКА ДЛЯ ГОЛЬФА", "ЛЫЖНАЯ ПАЛКА", "ЛЫЖА", "ХОККЕЙНАЯ КЛЮШКА", "УДОЧКА"],
        ["ЩИПКИ ДЛЯ НОГТЕЙ", "ПАЧЕЧКА", "ЭЛЕКТРОБРИТВА", "ПИЛКА ДЛЯ НОГТЕЙ", "ЩЁТКА ДЛЯ ВОЛОС", "БРИТВЕННЫЙ СТАНОК", "ЗУБНАЯ ЩЕТКА"],
        ["ДИВАН", "КРЕСЛО", "БУФЕТ", "КРОВАТЬ", "ТУМБОЧКА", "ОБЕДЕННЫЙ СТОЛ", "ШКАФ"],
        ["ПЕСОЧНИЦА", "КАРУСЕЛЬ", "ГОРКА", "ИГРОВОЙ ГОРОДОК", "КАЧЕЛИ", "БАТУТ", "ЛЕСЕНКА-ПАУТИНКА"],
        ["КОНУС", "ЦИЛИНДР", "КУБ", "КРУГ", "ТРЕУГОЛЬНИК", "ПРЯМОУГОЛЬНИК", "КВАДРАТ"],
        ["КОДОВЫЙ ЗАМОК", "КЛЮЧ ОТ МАШИНЫ", "КЛЮЧИ ОТ ДОМА", "ЗАСОВ", "ОТМЫЧКИ", "НАВЕСНОЙ ЗАМОК", "ВЕЛОСИПЕДНЫЙ ЗАМОК"],
        ["КАША", "МЯСО", "ОВОЩИ", "ФРУКТЫ", "МАКАРОНЫ", "ХЛЕБ", "СЫР"],
        ["БОКАЛ", "ЧАШКА", "СТАКАН", "КУБОК", "БЛЮДЦЕ", "ТАРЕЛКА", "БЛЮДО"],
        ["КУКЛА", "КУБИКИ", "ПЛЮШЕВЫЙ МИШКА", "САМОЛЕТИК", "ЛОШАДКА-КАЧАЛКА", "СОЛДАТИК", "ПАРОВОЗИК"],
        ["ЗУБОЧИСТКА", "ШУРУП", "ГВОЗДЬ", "ШПРИЦ", "БУЛАВКА", "ВЯЗАЛЬНЫЙ КРЮЧОК", "ЗАМОК"],
        ["СТОЛОВЫЙ НОЖ", "ПОВАРЕШКА", "ЧАЙНАЯ ЛОЖКА", "СТОЛОВАЯ ЛОЖКА", "НОЖ ДЛЯ МАСЛА", "ЛОПАТОЧКА", "ВИЛКА"],
        ["ГОЛЕНЬ", "БЕДРО", "СПИНА", "ЗАПЯСТЬЕ", "ЖИВОТ", "СТУПНЯ", "ПРЕДПЛЕЧЬЕ"],
        ["ПОЛЁТ НА ДЕЛЬТАПЛАНЕ", "СЕРФИНГ", "СКЕЙТБОРДИНГ", "СПЕЛЕОЛОГИЯ", "ПРЫЖОК С ПАРАШЮТОМ", "ПОЛЁТ НА ШАРЕ", "СКАЛОЛАЗАНИЕ"]
        ["МИКРОФОН", "ШАПКА-НАУШНИКИ", "СТЕРЕОДИНАМИКИ", "МЕГАФОН", "ЗАТЫЧКИ В УШИ", "НАУШНИКИ", "ТЕЛЕФОН"],
        ["ЗАМОК", "ДВЕРНЫЕ ПЕТЛИ", "ДВЕРНАЯ РУЧКА", "ДВЕРЬ", "ДВЕРНОЙ ЗВОНОК", "ДВЕРНОЙ ПРОЕМ", "ЗАМОЧНАЯ СКВАЖИНА"],
        ["ОДЕЖДА", "ОБУВЬ", "ЕДА", "ЛЕКАРСТВА", "ВАННЫЕ ПРИНАДЛЕЖНОСТИ", "НАПИТКИ", "КОСМЕТИКА"],
        ["ВИШНЯ", "АРБУЗ", "ЗЕМЛЯНИКА", "ЧЕРНИКА", "СЛИВА", "ПЕРСИК", "ЯБЛОКО"],
        ["БАБОЧКА", "МУХА", "ЖУК", "МУРАВЕЙ", "ПАУК", "ОСА", "СОРОКОНОЖКА"],
        ["ЛЯГУШКА", "ЯЩЕРИЦА", "УЛИТКА", "ДЕЛЬФИН", "АКУЛА", "КИТ", "ЗМЕЯ"],
        ["ДЕРЕВО", "ПЕНЬ", "ШИШКА", "ТРАВА", "ПАПОРОТНИК", "КУСТ", "ЦВЕТОК"],
        ["СОБАКА", "ЗАЯЦ", "МЕДВЕДЬ", "МЫШЬ", "ЛЕТУЧАЯ МЫШЬ", "ЁЖ", "КОШКА"],
        ["БЕГЕМОТ", "ДРАКОН", "НОСОРОГ", "ПЕГАС", "ЗЕБРА", "ЕДИНОРОГ", "КРОКОДИЛ"]

    ],
    [
        ["СОБАКА-ПОВОДЫРЬ", "СОБАКА-СПАСАТЕЛЬ", "ПОЛИЦЕЙСКАЯ СОБАКА", "ПАСТУШЬЯ СОБАКА", "ОХОТНИЧЬЯ СОБАКА", "СТОРОЖЕВАЯ СОБАКА", "ДЕКОРАТИВНАЯ СОБАЧКА"],
        ["ЗВЕЗДНЫЙ ПУТЬ", "МАТРИЦА", "ТЕРМИНАТОР", "ЧУЖОЙ", "БЕГУЩИЙ ПО ЛЕЗВИЮ БРИТВЫ", "ЗВЕЗДНЫЕ ВОЙНЫ", "АВАТАР"],
        ["ЗЕЛЕНЫЙ", "Синий", "КРАСНЫЙ", "ЖЕЛТЫЙ", "СИРЕНЕВЫЙ", "Розовый", "КОРИЧНЕВЫЙ"],
        ["КОЗА", "ЛОШАДЬ", "ОСЕЛ", "ТЕЛЁНОК", "ОВЦА", "Свинья", "КОРОВА"],
        ["ЛАЙМ", "Киви", "МАНДАРИН", "Лимон", "АПЕЛЬСИН", "ГРЕЙПФРУТ", "АНАНАС"],
        ["Эльф", "Гном", "ФЕЯ", "ТРОЛЛЬ", "ГОБЛИН", "ДРИАДА", "ВЕЛИКАН"],
        ["ПРИНЦЕССА НА ГОРОШИНЕ", "БЕЛОСНЕЖКА", "ВАСИЛИСА ПРЕКРАСНАЯ", "СПЯЩАЯ КРАСАВИЦА", "КРАСНАЯ ШАПОЧКА", "ЗОЛУШКА", "СНЕЖНАЯ КОРОЛЕВА"],
        ["Брокколи", "РЕДИС", "Помидор", "ТЫКВА", "БАКЛАЖАН", "ОГУРЕЦ", "КАРТОФЕЛЬ"],
        ["МЛАДЕНЕЦ", "ДЕВОЧКА", "МАЛЬЧИК", "ЖЕНЩИНА", "МУЖЧИНА", "СТАРУХА", "СТАРИК"],
        ["КУРИЦА", "ИНДЕЙКА", "ФАЗАН", "ЦЫПЛЕНОК", "ПЕТУХ", "ПАВЛИН", "УТКА"],
        ["ГАРРИ ПОТТЕР", "Люди Икс", "охотники за привидениями", "ВЛАСТЕЛИН КОЛЕЦ", "Ночной Дозор", "КОНАН-ВАРВАР", "ХРОНИКИ НАРНИИ"],
        ["Лилия", "ОДУВАНЧИК", "МАРГАРИТКА", "ТЮЛЬПАН", "Гвоздика", "Подсолнух", "РОЗА"],
        ["БЕЛКА", "Кролик", "КРЫСА", "БОБёР", "ГОРНОСТАЙ", "ТУШКАНЧИК", "Мышь"],
        ["АКАЦИЯ", "КЛЕН", "Дуб", "БЕРЁЗА", "МОЖЖЕВЕЛЬНик", "СОСНА", "ЕЛЬ"],
        ["мутант", "ЗОМБИ", "ПРИЗРАК", "СКЕЛЕТ", "ОБОРОТЕНЬ", "Мумия", "ВАМПИР"],
        ["БУРАТИНО", "СЕМЕРО КОЗЛЯТ", "ТРИ МЕДВЕДЯ", "ЗОЛОТАЯ РЫБКА", "ЦАРЕВНА-ЛЯГУШКА", "ТРИ ПОРОСЕНКА", "ГАДКИЙ УТЕНОК"],
        ["ЗЕЛЕНЫЙ ПЕРЕЦ", "МОРКОВЬ", "ЦВЕТНАЯ КАПУСТА", "КАПУСТА", "Лук", "СВЕКЛА", "ЧЕСНОК"],
        ["ФУТБОЛИСТ", "АКВАЛАНГИСТ", "ХОККЕИСТ", "ТЕННИСИСТ", "СНОУБОРДЕР", "Лыжник", "Альпинист"],
        ["Языки ПЛАМЕНИ", "МАНГАЛ", "ЭЛЕКТРИЧЕСКАЯ ПЛИТА", "Уголь", "КАМИН", "КОСТЕР", "ГАЗОВАЯ ПЛИТА"],
        ["КЕШЬЮ", "ГРЕЦКИЙ ОРЕХ", "МИНДАЛЬ", "АРАХИС", "Фисташки", "Кокос", "СЕМЕЧКИ ПОДСОЛНУХА"],
        ["ПОДЗЕМНЫЙ ПЕРЕХОД", "тротуар", "ГРУНТОВАЯ ДОРОГА", "УЛИЦА", "ОБОЧИНА", "АВТОМАГИСТРАЛЬ", "ПЕШЕХОДНЫЙ ПЕРЕХОД"],
        ["ТРУСЫ", "Чулки", "Колготки", "Лосины", "СПОРТИВНЫЕ ШТАНЫ", "Гольфы", "Носки"],
        ["ПИРОГ", "ТОРТ", "Булочка", "ЯИЧНИЦА", "Пицца", "Блинчик", "ПЕЧЕНЬЕ"],
        ["Большой ТЕННИС", "Пинг-понг", "КЕРЛИНГ", "БАДМИНТОН", "ВОЛЕЙБОЛ", "ХОККЕЙ", "Гольф"],
        ["Кроссовки", "Ботфорты", "ТУРИСТИЧЕСКИЕ БОТИНКИ", "РЕЗИНОВЫЕ САПОГИ", "САНДАЛИИ", "ТУФЛИ НА КАБЛУКЕ", "ДОМАШНИЕ ТАПОЧКИ"],
        ["Сок", "Пиво", "ВОДА", "ГАЗИРОВКА", "ШАМПАНСКОЕ", "Молоко", "Вино"],
        ["ЭЛЕКТРИЧЕСКАЯ ПЛИТА", "ДУХОВКА", "Холодильник", "МОРОЗИЛКА", "СТИРАЛЬНАЯ МАШИНА", "ПОСУДОМОЕЧНАЯ МАШИНА", "МИКРОВОЛНОВКА"]
    ],
    [
        ["ДЕВОЧКА", "ЖЕНЩИНА", "Дочь", "МАТЬ", "ВНУЧКА", "БАБУШКА", "СЕСТРА"],
        ["КАРМАННИК", "ВОР", "ТЕРРОРИСТ", "ГРАБИТЕЛЬ", "КОНТРАБАНДИСТ", "Взломщик", "Угонщик"],
        ["Одноклассник", "Друг", "СОСЕД", "КОЛЛЕГА", "НАЧАЛЬНИК", "РОДСТВЕННИК", "ПОДЧИНЕННЫЙ"],
        ["ФОРЕЛЬ", "КАРАСЬ", "ТУНЕЦ", "кари", "КАМБАЛА", "Лосось", "ЩУКА"],
        ["ПЕЩЕРНЫЙ ЧЕЛОВЕК", "БРОДЯГА", "ОТШЕЛЬНИК", "КАННИБАЛ", "ШИМПАНЗЕ", "ГОРИЛЛА", "Изгой"],
        ["Рысь", "Волк", "ПАНТЕРА", "Лиса", "ГИЕНА", "тигр", "Койот"],
        ["БРАТ", "МАЛЬЧИК", "МУЖЧИНА", "Сын", "ОТЕЦ", "Внук", "Дед"],
        ["НЕЗНАКОМЕЦ", "УБИЙЦА", "скиталец", "БАНДИТ", "АФЕРИСТ", "ВОР", "ИНОСТРАНЕЦ"],
        ["ЛЫСИНА", "СВЕТЛЫЕ ВОЛОСЫ", "РЫЖИЕ ВОЛОСЫ", "ПРЯМЫЕ ВОЛОСЫ", "СЕДЫЕ ВОЛОСЫ", "КУДРЯВЫЕ ВОЛОСЫ", "ТЕМНЫЕ ВОЛОСЫ"],
        ["ОРЕЛ", "ВОРОБЕЙ", "Синица", "ВОРОНА", "Голубь", "ДЯТЕЛ", "ЛАСТОЧКА"],
        ["СЧАСТЛИВЫЙ", "УДИВЛЕННЫЙ", "Довольный", "СЕРДИТЫЙ", "ЛЮБОЗНАТЕЛЬНЫЙ", "ОБИЖЕННЫЙ", "Грустный"],
        ["Бизон", "Бык", "ГОРНЫЙ КОЗЕЛ", "Антилопа", "Лось", "баран", "ОЛЕНЬ"],
        ["ПОДВАЛ", "Кухня", "Гостиная", "СПАЛЬНЯ", "ВАННАЯ", "ДЕТСКАЯ", "ЧЕРДАК"],
        ["РАВНИНА", "Болото", "луг", "УСТЬЕ РЕКИ", "ИСТОК РЕКИ", "Пустыня", "Плато"],
        ["БРОШЮРА", "КАТАЛОГ", "ТЕЛЕФОННЫЙ СПРАВОЧНИК", "Инструкция", "ГАЗЕТА", "ЖУРНАЛ", "УЧЕБНИК"],
        ["УНИВЕРМАГ", "ДОМ ПРЕСТАРЕЛЫХ", "ПСИХИАТРИЧЕСКАЯ ЛЕЧЕБНИЦА", "ШКОЛА", "МЭРИЯ", "ТЕАТР", "ЖЕЛЕЗНОДОРОЖНАЯ СТАНЦИЯ"],
        ["ЧАША", "БОТАНИЧЕСКИЙ САД", "ЛЕСОПОЛОСА", "ЖИВАЯ ИЗГОРОДЬ", "БЕРЁЗОВАЯ РОЩА", "СОСНОВЫЙ БОР", "ФРУКТОВЫЙ САД"],
        ["ФУНИКУЛЁР", "ТРАМВАЙ", "МЕТРО", "КАНАТНАЯ ДОРОГА", "МОНОРЕЛЬС", "ЭЛЕКТРИЧКА", "ЭКСПРЕСС"],
        ["КАФЕ", "СТОЛОВАЯ", "бар", "РЕСТОРАН", "ЗАВТРАК", "ОБЕД", "Ужин"],
        ["ФЛЕЙТА", "ВАЛТОРНА", "ТРУБА", "Горн", "СКРИПКА", "ГИТАРА", "КОНТРАБАС"],
        ["Плот", "БАЙДАРКА", "КАНОЭ", "ПАРУСНАЯ ЛОДКА", "РЫБАЦКАЯ ЛОДКА", "ГРЕБНАЯ ЛОДКА", "ЯХТА"],
        ["НАПОЛЬНАЯ ПЛИТКА", "БЕТОННЫЙ пол", "КОВЕР", "ПАРКЕТ", "Линолеум", "ДЕРЕВЯННЫЙ ПОЛ", "ЗЕМЛЯНОЙ пол"],
        ["УЩЕЛЬЕ", "КАНЬОН", "Долина", "ОБРЫВ", "Холм", "СКАЛА", "ГОРА"],
        ["САЛФЕТКА", "ТРЯПКА", "ПОЛОТЕНЦЕ", "ПЛАТОК", "ЛОСКУТНОЕ ОДЕЯЛО", "ШЕРСТЯНОЕ ОДЕЯЛО", "СКАТЕРТЬ"],
        ["ОСОБНЯК", "ЧАСОВНЯ", "СОБОР", "Замок", "ЦЕРКОВЬ", "МОНАСТЫРЬ", "ДВОРЕЦ"],
        ["ПУСТЫРЬ", "ЛУЖАЙКА", "ОПУШКА", "ПРОСЕКА", "пшеничное ПОЛЕ", "КУКУРУЗНОЕ ПОЛЕ", "РИСОВОЕ ПОЛЕ"],
        ["МАЛОЛИТРАЖКА", "УНИВЕРСАЛ", "Минивэн", "СЕДАН", "КАБРИОЛЕТ", "СПОРТКАР", "ПРЕДСТАВИТЕЛЬСКИЙ АВТОМОБИЛЬ"],
        ["Дача", "МНОГОКВАРТИРНЫЙ дом", "МАГАЗИН", "ОФИСНОЕ ЗДАНИЕ", "НЕБОСКРЕБ", "ВИЛЛА", "Склад"],
        ["КОШЕЛЕК", "БУМАЖНИК", "ДАМСКАЯ СУМОЧКА", "ХОЗЯЙСТВЕННАЯ СУМКА", "Дипломат", "ЧЕМОДАН", "РЮКЗАК"],
        ["KATEP", "РЕЧНОЙ ТРАМВАЙЧИК", "КРУИЗНОЕ СУДНО", "БРИГАНТИНА", "ШХУНА", "АВИАНОСЕЦ", "НЕФТЕНАЛИВНОЙ ТАНКЕР"],
        ["Огромный", "ГЛУБОКИЙ", "Узкий", "МАЛЕНЬКИЙ", "Низкий", "МЕЛКИЙ", "Высокий"],
        ["ВЕСНА", "ЛЕТО", "ОСЕНЬ", "Зима", "КВАРТАЛ", "Год", "ВЕК"],
        ["САРАЙ", "ИЗБА", "СТОРОЖКА", "ШАТЕР", "тент", "ПАЛАТКА", "ВИГВАМ"],
        ["ПЕСОК", "ГРАВИЙ", "Булыжники", "Грунт", "ил", "Глина", "Грязь"],
        ["ВЧЕРА", "Сегодня", "НА СЛЕДУЮЩЕЙ НЕДЕЛЕ", "ВЫХОДНЫЕ", "ЗАВТРА", "НЕДЕЛЯ", "ДЕНЬ"],
        ["ПЛЯЖНЫЙ ВОЛЕЙБОЛ", "БАСКЕТБОЛ", "Боулинг", "ВЫШИБАЛЫ", "ВОДНОЕ ПОЛО", "Футбол", "ПЕТАНК"],
        ["ДЕНЬ РОЖДЕНИЯ", "СВАДЬБА", "НОВОСЕЛЬЕ", "ВЕЧЕРИНКА", "КОРПОРАТИВ", "БАЛ", "ПОСЛЕДНИЙ ЗВОНОК"],
        ["КРЕЩЕНИЕ", "ПОЛУЧЕНИЕ ДИПЛОМА", "БРАКОСОЧЕТАНИЕ", "РОЖДЕНИЕ ПЕРВЕНЦА", "РАЗВОД", "УХОД НА ПЕНСИЮ", "ПОХОРОНЫ"],
        ["КРОСС", "БЕГ С ПРЕПЯТСТВИЯМИ", "СПОРТИВНАЯ ХОДЬБА", "ТРИАТЛОН", "МАРАФОН", "СПРИНТ", "ЭСТАФЕТА"],
        ["Плотность", "ГЛУБИНА", "ШИРИНА", "ВЕС", "МАССА", "СИЛА", "Высота"],
        ["Июль", "март", "ОКТЯБРЬ", "АПРЕЛЬ", "СЕНТЯБРЬ", "Август", "Июнь"],
        ["Лыжные очки", "МИКРОСКОП", "ТЕЛЕСКОП", "СОЛНЦЕЗАЩИТНЫЕ очки", "Бинокль", "ТЕАТРАЛЬНЫЙ БИНОКЛЬ", "Очки ДЛЯ ПЛАВАНИЯ"],
        ["ЦУНАМИ", "НАВОДНЕНИЕ", "УРАГАН", "ГРОЗА", "ЗАСУХА", "ВЬЮГА", "ЗЕМЛЕТРЯСЕНИЕ"],
        ["Мох", "ГРИБ", "гниль", "РЯСКА", "ЛИШАЙНИК", "Плесень", "Водоросль"],
        ["ЗАГОРАТЬ", "ЛЕЖАТЬ НА ВОДЕ", "Стоять В ВОДЕ", "Нырять", "ПЛАВАТЬ БРАСОМ", "ПЛАВАТЬ ПО-СОБАЧЬИ", "ПЛАВАТЬ КРОЛЕМ"],
        ["Отпуск", "ПОЕЗДКА", "Однодневная ПОЕЗДКА", "ЭМИГРАЦИЯ", "ЭКСКУРСИЯ", "КОМАНДИРОВКА", "Пикник"],
        ["ЛЕКЦИЯ", "СЕМИНАР", "ПРЕСС-КОНФЕРЕНЦИЯ", "ОПЕРА", "ВЫСТАВКА", "Мюзикл", "Концерт"],
        ["БЕГ НА БЕГОВОЙ ДОРОЖКЕ", "УТРЕННЯЯ ПРОБЕЖКА", "зарядка", "ПРОГУЛКА", "ХОДЬБА СТРОЕМ", "Однодневный ПОХОД", "Многодневный поход"],
        ["ПРЫЖКИ В ВЫСОТУ", "ПРЫЖКИ В ДЛИНУ", "ПРЫЖКИ С ШЕСТОМ", "МЕТАНИЕ МОЛОТА", "МЕТАНИЕ КОПЬЯ", "МЕТАНИЕ ДИСКА", "ТОЛКАНИЕ ЯДРА"],
        ["СПЕРЕДИ", "СЗАДИ", "ПОСЕРЕДИНЕ", "ЧЕРЕЗ", "Насквозь", "Вместе", "По отдельности"],
        ["Слово о полКУ ИГОРЕВЕ", "ГОРЕ ОТ УМА", "ЕВГЕНИЙ ОНЕГИН", "МЕРТВЫЕ ДУШИ", "муму", "ВОЙНА И МИР", "ГРОЗА"],
        ["ЧЕК", "КРЕДИТНАЯ КАРТА", "ПРАВА", "Билет", "СЧЕТ", "КВИТАНЦИЯ", "ЭТИКЕТКА"],
        ["ГЕЛЬ ДЛЯ ДУША", "Мыло", "КРЕМ ДЛЯ БРИТЬЯ", "ЖИДКОЕ МЫЛО", "СКРАБ", "КРЕМ ПОСЛЕ БРИТЬЯ", "ШАМПУНЬ"],
        ["Город", "ЦЕНТР ГОРОДА", "МЕГАПОЛИС", "МИКРОРАЙОН", "ОКРЕСТНОСТЬ", "ДЕРЕВНЯ", "ПРИГОРОД"],
        ["ВОРОТА", "ВРАЩАЮЩАЯСЯ ДВЕРЬ", "ЧЕРНЫЙ ХОД", "АВТОМАТИЧЕСКАЯ ДВЕРЬ", "ПАРАДНЫЙ ВХОД", "ДВЕРЦА ДЛЯ КОШКИ", "ПОДЪЁМНАЯ ДВЕРЬ"],
        ["ТАНГО", "ВАЛЬС", "САЛЬСА", "БРЕЙК-ДАНС", "БАЛЕТ", "Твист", "Степ"],
        ["ИСТОРИЧЕСКИЙ РОМАН", "НАУЧНАЯ ФАНТАСТИКА", "ФЭНТЕЗИ", "ЛЮБОВНЫЙ РОМАН", "ДЕТЕКТИВ", "УЖАСЫ", "ПРИКЛЮЧЕНИЯ"],
        ["БЕЗДЕЛЬНИЧАТЬ", "Спать", "Ползти", "Отдыхать", "ТЕРЯТЬ СОЗНАНИЕ", "Ложиться", "УМИРАТЬ"],
        ["Лен", "ЛАЙКРА", "ШЕРСТЬ", "КОЖА", "ШЕЛК", "Хлопок", "РЕЗИНА"],
        ["ВИКТОРИНА", "ФАНТЫ", "РОЛЕВАЯ ИГРА", "ИГРА В СЛОВА", "НАСТОЛЬНАЯ ИГРА", "КОНСТРУКТОР", "ИГРА В СОЛДАТИКИ"],
        ["Поворот", "ЕЗДА", "ДВИЖЕНИЕ", "ТОРМОЗ", "УСКОРЕНИЕ", "ОСТАНОВКА", "ТОРМОЖЕНИЕ"],
        ["Антисептик", "ДЕЗОДОРАНТ", "Лосьон", "СПРЕЙ ОТ НАСЕКОМЫХ", "Жидкость для ПОЛОСКАНИЯ РТА", "ЗУБНАЯ ПАСТА", "КРЕМ ОТ ЗАГАРА"],
        ["Химия", "Физика", "ГЕОГРАФИЯ", "математика", "Русский язык", "История", "Биология"],
        ["ДЕКЛАМИРОВАНИЕ", "Крик", "РЫДАНИЕ", "Пение", "Шепот", "РАЗГОВОР", "Свист"],
        ["УЗНИК АЗКАБАНА", "ФилософскИЙ КАМЕНЬ", "ТАЙНАЯ КОМНАТА", "Кубок огня", "Принц-ПОЛУКРОВКА", "ДАРЫ СМЕРТИ", "орден ФЕНИКСА"],
        ["шпага", "САБЛЯ", "ЯТАГАН", "Нож", "Кинжал", "МАЧЕТЕ", "Стилет"],
        ["ШАХМАТЫ", "Шашки", "го", "Домино", "Лото", "КАРТЫ", "НАРДЫ"],
        ["ПЛАНЕТА", "КОМЕТА", "ГАЛАКТИКА", "АСТЕРОИД", "СВЕРХНОВАЯ ЗВЕЗДА", "ЧЁРНАЯ ДЫРА", "ТУМАННОСТЬ"],
        ["Монополия", "СКРАБЛ", "ДИКИЕ ДЖУНГЛи", "Диксит", "ДЖЕНГА", "Уно", "твистер"],
        ["Дон Кихот", "КОРОЛЬ АРТУР", "КАПИТАН Флинт", "РОБИНЗОН КРУЗО", "ГЕРКУЛЕС", "ОДИССЕЙ", "Робин Гуд"],
        ["СОБАКА-ПОВОДЫРЬ", "СОБАКА-СПАСАТЕЛЬ", "ПОЛИЦЕЙСКАЯ СОБАКА", "ПАСТУШЬЯ СОБАКА", "ОХОТНИЧЬЯ СОБАКА", "СТОРОЖЕВАЯ СОБАКА", "ДЕКОРАТИВНАЯ СОБАЧКА"],
        ["ЗВЕЗДНЫЙ ПУТЬ", "МАТРИЦА", "ТЕРМИНАТОР", "ЧУЖОЙ", "БЕГУЩИЙ ПО ЛЕЗВИЮ БРИТВЫ", "ЗВЕЗДНЫЕ ВОЙНЫ", "АВАТАР"],
        ["ЗЕЛЕНЫЙ", "СИНИЙ", "КРАСНЫЙ", "ЖЕЛТЫЙ", "СИРЕНЕВЫЙ", "РОЗОВЫЙ", "КОРИЧНЕВЫЙ"],
        ["КОЗА", "ЛОШАДЬ", "ОСЕЛ", "ТЕЛЁНОК", "ОВЦА", "СВИНЬЯ", "КОРОВА"],
        ["ЛАЙМ", "КИВИ", "МАНДАРИН", "ЛИМОН", "АПЕЛЬСИН", "ГРЕЙПФРУТ", "АНАНАС"],
        ["ЭЛЬФ", "ГНОМ", "ФЕЯ", "ТРОЛЛЬ", "ГОБЛИН", "ДРИАДА", "ВЕЛИКАН"],
        ["ПРИНЦЕССА НА ГОРОШИНЕ", "БЕЛОСНЕЖКА", "ВАСИЛИСА ПРЕКРАСНАЯ", "СПЯЩАЯ КРАСАВИЦА", "КРАСНАЯ ШАПОЧКА", "ЗОЛУШКА", "СНЕЖНАЯ КОРОЛЕВА"],
        ["БРОККОЛИ", "РЕДИС", "ПОМИДОР", "ТЫКВА", "БАКЛАЖАН", "ОГУРЕЦ", "КАРТОФЕЛЬ"],
        ["МЛАДЕНЕЦ", "ДЕВОЧКА", "МАЛЬЧИК", "ЖЕНЩИНА", "МУЖЧИНА", "СТАРУХА", "СТАРИК"],
        ["КУРИЦА", "ИНДЕЙКА", "ФАЗАН", "ЦЫПЛЕНОК", "ПЕТУХ", "ПАВЛИН", "УТКА"],
        ["ГАРРИ ПОТТЕР", "ЛЮДИ ИКС", "ОХОТНИКИ ЗА ПРИВИДЕНИЯМИ", "ВЛАСТЕЛИН КОЛЕЦ", "НОЧНОЙ ДОЗОР", "КОНАН-ВАРВАР", "ХРОНИКИ НАРНИИ"],
        ["ЛИЛИЯ", "ОДУВАНЧИК", "МАРГАРИТКА", "ТЮЛЬПАН", "ГВОЗДИКА", "ПОДСОЛНУХ", "РОЗА"],
        ["БЕЛКА", "КРОЛИК", "КРЫСА", "БОБЁР", "ГОРНОСТАЙ", "ТУШКАНЧИК", "МЫШЬ"],
        ["АКАЦИЯ", "КЛЕН", "ДУБ", "БЕРЁЗА", "МОЖЖЕВЕЛЬНИК", "СОСНА", "ЕЛЬ"],
        ["МУТАНТ", "ЗОМБИ", "ПРИЗРАК", "СКЕЛЕТ", "ОБОРОТЕНЬ", "МУМИЯ", "ВАМПИР"],
        ["БУРАТИНО", "СЕМЕРО КОЗЛЯТ", "ТРИ МЕДВЕДЯ", "ЗОЛОТАЯ РЫБКА", "ЦАРЕВНА-ЛЯГУШКА", "ТРИ ПОРОСЕНКА", "ГАДКИЙ УТЕНОК"],
        ["ЗЕЛЕНЫЙ ПЕРЕЦ", "МОРКОВЬ", "ЦВЕТНАЯ КАПУСТА", "КАПУСТА", "ЛУК", "СВЕКЛА", "ЧЕСНОК"],
        ["ФУТБОЛИСТ", "АКВАЛАНГИСТ", "ХОККЕИСТ", "ТЕННИСИСТ", "СНОУБОРДЕР", "ЛЫЖНИК", "АЛЬПИНИСТ"],
        ["ЯЗЫКИ ПЛАМЕНИ", "МАНГАЛ", "ЭЛЕКТРИЧЕСКАЯ ПЛИТА", "УГОЛЬ", "КАМИН", "КОСТЕР", "ГАЗОВАЯ ПЛИТА"],
        ["КЕШЬЮ", "ГРЕЦКИЙ ОРЕХ", "МИНДАЛЬ", "АРАХИС", "ФИСТАШКИ", "КОКОС", "СЕМЕЧКИ ПОДСОЛНУХА"],
        ["ПОДЗЕМНЫЙ ПЕРЕХОД", "ТРОТУАР", "ГРУНТОВАЯ ДОРОГА", "УЛИЦА", "ОБОЧИНА", "АВТОМАГИСТРАЛЬ", "ПЕШЕХОДНЫЙ ПЕРЕХОД"],
        ["ТРУСЫ", "ЧУЛКИ", "КОЛГОТКИ", "ЛОСИНЫ", "СПОРТИВНЫЕ ШТАНЫ", "ГОЛЬФЫ", "НОСКИ"],
        ["ПИРОГ", "ТОРТ", "БУЛОЧКА", "ЯИЧНИЦА", "ПИЦЦА", "БЛИНЧИК", "ПЕЧЕНЬЕ"],
        ["БОЛЬШОЙ ТЕННИС", "ПИНГ-ПОНГ", "КЕРЛИНГ", "БАДМИНТОН", "ВОЛЕЙБОЛ", "ХОККЕЙ", "ГОЛЬФ"],
        ["КРОССОВКИ", "БОТФОРТЫ", "ТУРИСТИЧЕСКИЕ БОТИНКИ", "РЕЗИНОВЫЕ САПОГИ", "САНДАЛИИ", "ТУФЛИ НА КАБЛУКЕ", "ДОМАШНИЕ ТАПОЧКИ"],
        ["СОК", "ПИВО", "ВОДА", "ГАЗИРОВКА", "ШАМПАНСКОЕ", "МОЛОКО", "ВИНО"],
        ["ЭЛЕКТРИЧЕСКАЯ ПЛИТА", "ДУХОВКА", "ХОЛОДИЛЬНИК", "МОРОЗИЛКА", "СТИРАЛЬНАЯ МАШИНА", "ПОСУДОМОЕЧНАЯ МАШИНА", "МИКРОВОЛНОВКА"]

    ],
    [
        ["УЧЕБНИК", "ЭНЦИКЛОПЕДИЯ", "СЛОВАРЬ", "ТЕТРАДЬ", "Блокнот", "Дневник", "альбом"],
        ["НАРЕЧИЕ", "ПРЕДЛОГ", "ГЛАГОЛ", "ПРИЛАГАТЕЛЬНОЕ", "МЕЖДОМЕТИЕ", "Союз", "СУЩЕСТВИТЕЛЬНОЕ"],
        ["АВЕЛЬ", "Иуда", "Адам", "Нои", "Давид", "Клин", "МОИСЕЙ"],
        ["Дождь", "ЛИВЕНЬ", "ГРАД", "СТРУЯ", "ВОДОВОРОТ", "ТЕЧЕНИЕ", "СМЕРЧ"],
        ["ЗДЕСЬ", "Потом", "Это", "СЕЙЧАС", "ТАМ", "ВСЕГДА", "НИКОГДА"],
        ["ЖЕНА", "HEBECTA", "БЫВШАЯ ЖЕНА", "ВОЗЛЮБЛЕННАЯ", "КОЛЛЕГА", "ДЕВУШКА ДРУГА", "ПОДРУГА"],
        ["ЧЕРТЕЖ", "КОЛЛАЖ", "АКВАРЕЛЬ", "гравюра", "МОЗАИКА", "НАБРОСОК", "КАРТИНА МАСЛОМ"],
        ["СТИХОТВОРЕНИЕ", "ПРОЛОГ", "СТАТЬЯ", "Поэма", "ПОВЕСТЬ", "КОНСПЕКТ", "РАССКАЗ"],
        ["Когда", "Что", "Сколько", "Кто", "ЗАЧЕМ", "KAK", "Где"],
        ["ЮЛИЙ ЦЕЗАРЬ", "Чингисхан", "Да Винчи", "АЛЕКСАНДР МАКЕДОНСКИЙ", "ТУТАНХАМОН", "ГАЛИЛЕЙ", "АРИСТОТЕЛЬ"],
        ["туман", "ВАКУУМ", "ВЕТЕР", "Воздух", "темнота", "Бриз", "СУМЕРКИ"],
        ["Bы", "ОНА", "Я", "Они", "Ты", "Он", "Мы"],
        ["МУЖ", "ВОЗЛЮБЛЕННЫЙ", "Друг", "ЗНАКОМЫЙ", "ЛЮБОВНИК", "Бывший муж", "ЖЕНИХ"],
        ["Фотография", "ФРЕСКА", "КАРТИНА", "ПЛАКАТ", "ИЛЛЮСТРИРОВАННАЯ КНИГА", "ПУТЕВОДИТЕЛЬ", "БУКЛЕТ"],
        ["КЛАССИЧЕСКАЯ МУЗЫКА", "Диско", "Джаз", "Хип-хоп", "КАнТРИ", "Рок-н-ролл", "ЛАТИНА"],
        ["ДРУЖБА", "ЩЕДРОСТЬ", "САМООТВЕРЖЕННОСТЬ", "ЭНТУЗИАЗМ", "СИЛА ВОЛИ", "ХРАБРОСТЬ", "НАДЕЖНОСТЬ"],
        ["CTPAXOBKA", "Доля", "ИНВЕСТИРОВАНИЕ", "ЗАЛОГ", "ВЫПЛАТА", "НАЛОГ", "КРЕДИТ"],
        ["ДИПЛОМАТИЯ", "СОГЛАШЕНИЕ", "Спор", "ВСТРЕЧА", "ПЕРЕГОВОРЫ", "COBET", "Ультиматум"],
        ["ДЕПРЕССИЯ", "РАССЕЯННОСТЬ", "Эгоизм", "ЛЕНЬ", "БЕСПОМОЩНОсть", "СКУКА", "НЕРЕШИТЕЛЬНОСТЬ"],
        ["АКЦИОНЕР", "ФИНАНСОВЫЙ ДИРЕКТОР", "ГЛАВА ПРОФСОЮЗА", "ВИЦЕ-ПРЕЗИДЕНТ", "УЧРЕДИТЕЛЬ", "ПРЕДСЕДАТЕЛЬ СОВЕТА ДИРЕКТОРОВ", "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР"],
        ["Порядок", "ВЕЧНОСТЬ", "ТЕОРИЯ", "XAOC", "СУДЬБА", "ИДЕЯ", "ЖЕЛАНИЕ"],
        ["ИМПЕРАТОР", "Князь", "Принц", "БАРОН", "СУЛТАН", "ЦАРЬ", "Король"],
        ["ТЕОЛОГ", "Философ", "СТАТИСТИК", "Психолог", "Социолог", "Историк", "Экономист"],
        ["ПОВЕРХНОСТЬ", "Плотность", "Запах", "Вид", "Цвет", "Тон", "ФОРМА"],
        ["ВЕЖЛИВОСТЬ", "ЧЕСТНОСТЬ", "ОТКРЫТОСТЬ", "Порядочность", "ВЕРНОСТЬ", "ОТВЕТСТВЕННОСть", "ПРЕДАННОСТЬ"],
        ["СВИДЕТЕЛЬ", "Присяжный", "ПРОКУРОР", "СУДЕБНЫЙ ПРИСТАВ", "Судья", "Адвокат", "ОБВИНЯЕМЫЙ"],
        ["МОШЕННИЧЕСТВО", "Подлог", "КОНТРАБАНДА", "афера", "ПОДДЕЛКА", "ШАНТАЖ", "Взяточничество"],
        ["НЕДОВЕРИЕ", "Ярость", "ОТЧАЯНИЕ", "РЕВНОСТЬ", "Двуличность", "Зависть", "НЕНАВИСТЬ"],
        ["МЕНЕДЖЕР", "Сотрудник", "КЛИЕНТ", "РАБОТОДАТЕЛЬ", "КОНСУЛЬТАНТ", "АДМИНИСТРАТОР", "СТАЖёР"],
        ["ДАТЬ", "ПРЕДЛОЖИТЬ", "Взять", "ПООБЕЩАТЬ", "ПОБЛАГОДАРИТЬ", "Поклясться", "СПРОСИТЬ"],
        ["Министр", "Посол", "ДЕПУТАТ", "ПРЕЗИДЕНТ", "ПРЕМЬЕР-МИНИСТР", "ГУБЕРНАТОР", "МЭР"],
        ["ТАЙНЫЙ АГЕНТ", "ЧАСТНЫЙ ДЕТЕКТИВ", "РАЗВЕДЧИК", "ОХРАННИК", "СЛЕДОВАТЕЛЬ", "ТЕЛОХРАНИТЕЛЬ", "ВЫШИБАЛА"],
        ["Кроссовки", "Ботфорты", "ТУРИСТИЧЕСКИЕ БОТИНКИ", "РЕЗИНОВЫЕ САПОГИ", "САНДАЛИИ", "ТУФЛИ НА КАБЛУКЕ", "ДОМАШНИЕ ТАПОЧКИ"],
        ["Сок", "Пиво", "ВОДА", "ГАЗИРОВКА", "ШАМПАНСКОЕ", "Молоко", "Вино"],
        ["ЭЛЕКТРИЧЕСКАЯ ПЛИТА", "ДУХОВКА", "Холодильник", "МОРОЗИЛКА", "СТИРАЛЬНАЯ МАШИНА", "ПОСУДОМОЕЧНАЯ МАШИНА", "МИКРОВОЛНОВКА"],
        ["ГОРШОЧЕК", "ЧАЙНИК", "КОФЕЙНИК", "МИСКА", "ПРОТИВЕНЬ", "СКОВОРОДА", "КАСТРЮЛЯ"],
        ["СЕРЬГИ", "Кольцо", "ОЖЕРЕЛЬЕ", "МЕДАЛЬОН", "БРАСЛЕТ", "Бусы", "ДИАДЕМА"],
        ["Отдых", "РАБОТА", "УЧЕБА", "ТРЕНИРОВКА", "УБОРКА", "Готовка", "ПРОГУЛКА"],
        ["Пиджак", "РУБАШКА", "ФУТБОЛКА", "БЕЗРУКАВКА", "Блузка", "СВИТЕР", "КУРТКА"],
        ["Суп", "ГАРНИР", "ОСНОВНОЕ БЛЮДО", "САЛАТ", "ДЕСЕРТ", "ЗАКУСКА", "НАПИТОК"],
        ["ИГРАТЬ В ДОЧКИ-МАТЕРИ", "ИГРАТЬ В ПРЯТКИ", "ИГРАТЬ В ЖМУРКИ", "ИГРАТЬ В КУКЛЫ", "ИГРАТЬ В СОЛДАТИКОВ", "ИГРАТЬ В САЛКИ", "ИГРАТЬ В ДОКТОРА"],
        ["кепка", "каска", "ХОККЕЙНЫЙ ШЛЕМ", "ЧАЛМА", "КОВБОЙСКАЯ ШЛЯПА", "УШАНКА", "Мотоциклетный ШЛЕМ"],
        ["СОЕВЫЙ СОУС", "Уксус", "ГОРЧИЦА", "ХРЕН", "МАСЛО", "КЕТЧУП", "МАЙОНЕЗ"],
        ["МЫТЬ ПОСУДУ", "ПОДМЕТАТЬ", "СТИРАТЬ БЕЛЬЕ", "ПЫЛЕСОСИТЬ", "ВЫБРАСЫВАТЬ МУСОР", "ВЫТИРАТЬ ПЫЛЬ", "МЫТЬ ОКНА"],
        ["ФАКС", "НОУТБУК", "РАДИО", "КСЕРОКС", "ПРИНТЕР", "ТЕЛЕВИЗОР", "КОМПЬЮТЕР"],
        ["ФАРЫ", "ЗАЖИГАНИЕ", "КОРОБКА ПЕРЕДАЧ", "ДВИГАТЕЛЬ", "Руль", "ПЕДАЛЬ ГАЗА", "ПЕДАЛЬ ТОРМОЗА"],
        ["ЗООПАРК", "ХЛЕБ", "ПАСТБИЩЕ", "ЗАПОВЕДНИК", "ПАРК", "РАНЧО", "ФЕРМА"],
        ["Скульптор", "Юрист", "Кондуктор", "Художник", "СТОМАТОЛОГ", "ВРАЧ", "Официант"],
        ["ХИМИЧЕСКИЙ ЗАВОД", "СТАЛЕЛИТЕЙНЫЙ ЗАВОД", "ТЕКСТИЛЬНАЯ ФАБРИКА", "ОРУЖЕЙНЫЙ ЗАВОД", "АВТОМОБИЛЬНЫЙ ЗАВОД", "БУМАЖНАЯ ФАБРИКА", "ПИВОВАРНЯ"],
        ["СКОРАЯ ПОМОЩЬ", "БУЛЬДОЗЕР", "ПОЖАРНАЯ МАШИНА", "ЭКСКАВАТОР", "СНЕГОУБОРЩИК", "МУСОРОВОЗ", "ПОЛИЦЕЙСКАЯ МАШИНА"],
        ["ШАХТЕР", "ЮВЕЛИР", "Кузнец", "Водопроводчик", "ЛЕСОРУБ", "Плотник", "Садовник"],
        ["Флигель", "Крыльцо", "СОБАЧЬЯ БУДКА", "ТЕЛЕФОННАЯ БУДКА", "ДАЧНЫЙ ТУАЛЕТ", "СКВОРЕЧНИК", "КОРМУШКА ДЛЯ птиц"],
        ["ПРОДУКТОВАЯ ТЕЛЕЖКА", "ВЕЛОСИПЕД", "СКУТЕР", "ВАГОНЕТКА", "ТРЁХКОЛЁСНЫЙ ВЕЛОСИПЕД", "КВАДРОЦИКЛ", "МОПЕД"],
        ["ЗИМНИЙ САД", "КЛУМБА", "БАЛКОН", "ТЕРРАСА", "САД КАМНЕЙ", "ТЕПЛИЦА", "ОГОРОД"],
        ["АНАЛИЗ КРОВИ", "ТРОМБОЦИТЫ", "ПЛАЗМА", "ПЕРЕЛИВАНИЕ КРОВИ", "БЕЛЫЕ КРОВЯНЫЕ ТЕЛЬЦА", "КРАСНЫЕ КРОВЯНЫЕ ТЕЛЬЦА", "КРОВЬ"],
        ["Новый Год", "ДЕНЬ СВЯТОГО ВАЛЕНТИНА", "23 ФЕВРАЛЯ", "8 МАРТА", "1 АПРЕЛЯ", "ПАСХА", "ХЕЛЛОУИН"],
        ["АКТЕР", "УЧИТЕЛЬ", "ВЕДУЩИЙ НОВОСТЕЙ", "РЕПОРТЕР", "ПИСАТЕЛЬ", "БУХГАЛТЕР", "РУКОВОДИТЕЛЬ"],
        ["АТОМНАЯ ЭЛЕКТРОСТАНЦИЯ", "НЕФТЕПЕРЕРАБАТЫВАЮЩИЙ ЗАВОД", "УГОЛЬНАЯ ЭЛЕКТРОСТАНЦИЯ", "МЕСТОРОЖДЕНИЕ НЕФТИ", "УГОЛЬНАЯ ШАХТА", "ПЛОТИНА ГИДРОЭЛЕКТРОСТАНЦИИ", "ВЕТРЯНАЯ ЭЛЕКТРОСТАНЦИЯ"],
        ["МАРКЕР", "ШАРИКОВАЯ РУЧКА", "КАРАНДАШ", "ЦВЕТНОЙ КАРАНДАШ", "МЕЛОК", "УКАЗКА", "КИСТОЧКА"],
        ["ВИОЛОНЧЕЛИСТ", "УЛИЧНЫЙ СКРИПАЧ", "ИГРОК НА БАНДЖО", "СКРИПАЧ", "ГИТАРИСТ", "БАСИСТ", "АРФИСТ"],
        ["МАШИНИСТ", "ВЕЛОСИПЕДИСТ", "МОТОЦИКЛИСТ", "КОМБАЙНЕР", "ПЕШЕХОД", "ДАЛЬНОБОЙЩИК", "ВОДИТЕЛЬ АВТОБУСА"],
        ["СВЕТ СВЕЧИ", "СЕВЕРНОЕ СИЯНИЕ", "СВЕТ ФОНАРИКА", "ЛУННЫЙ СВЕТ", "СВЕТ ЛАМПЫ", "СОЛНЕЧНЫЙ СВЕТ", "СВЕТ УЛИЧНОГО ФОНАРЯ"]
    ]
];

let round = 1;
let openCards = [[], [], []];
let index = null;
const cards = document.querySelectorAll(".dice");
const textCards = document.querySelectorAll(".text.box");
const roundText = document.querySelector(".round");

// Функция для генерации случайного числа с учётом времени
function ultraRandom(min, max) {
    const now = Date.now();
    const timeBasedRandom = (now % 1000) / 1000;
    const randomValue = Math.random() * timeBasedRandom;

    // Преобразуем randomValue в диапазон от min до max
    return Math.floor(randomValue * (max - min + 1)) + min;
}

function openCard(number) {

    // Получаем случайный индекс для текущего раунда
    do {
        index = ultraRandom(0, cardsArray[round - 1].length - 1);
    } while (openCards[number].includes(index));

    //  Добавляем индекс открытой карты в массив
    openCards[number].push(index);

    for (let i = 0; i <= 6; i++) {
        textCards[number * 7 + i].textContent = cardsArray[round - 1][index][i];
    }
}

function openAllCards() {
    for (let i = 0; i <= 2; i++) {
        openCard(i);
        changCardsColor(i);
    }
    console.log("Открытые карты ", openCards);
}

function changCardsColor(index) {
    cards[index].className = `dice dice${round}`;
}

function newRound() {
    if (round < 4) {
        round++;
        console.log("Round ", round);
        roundText.textContent = "round " + round;
        openAllCards();
    }
}

function reloadPage() {
    location.reload()
}

window.onload = function () {
    openAllCards();
    const load = document.querySelector('.overlay.load');
    load.classList.add('hide');
}